src/Reports/ИС_МП_ЮнитЭкономика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ИС_МП_ЮнитЭкономика</Name>
			<Comment>ИнфоСофт Власова И.С. 29.08.24 УА #67818</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Reports/ИС_МП_ЮнитЭкономика/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//+ ИнфоСофт Власова И.С. 29.08.24 УА #67818
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	                 
	Профиль = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКомпоновки, "Профиль");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	// Описываются внешние наборы данных - для получения текущих цен и скидок
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ПолучитьВнешниеНаборыДанных(Профиль.Значение), ДанныеРасшифровки, Истина, Ложь);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, Ложь);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ОбщийМодуль = ОпределитьОбщийМодульРасчетаСебестоимости();
	ОбщийМодуль.ДобавитьПредупреждениеОПредварительномЗакрытииМесяца(ДокументРезультат, КомпоновщикНастроек);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 29.08.24 УА #67818

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Власова И.С. 29.08.24 УА #67818
Функция ПолучитьВнешниеНаборыДанных(Профиль)
	
	СтруктураДанных = Новый Структура;
	
	ЦеныВБ = ИС_WB_Сервер.ПолучитьИнформациюОСкидках(Профиль, 0);
	
	Если ЦеныВБ = Неопределено Тогда
		ЦеныВБ = Новый ТаблицаЗначений;
	Иначе      
		ЦеныВБ = ДобавитьНоменклатуруКЦенам(Профиль, ЦеныВБ);		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ЦеныВБ", ЦеныВБ);
	
	Возврат СтруктураДанных;
	
КонецФункции //- ИнфоСофт Власова И.С. 29.08.24 УА #67818

//+ ИнфоСофт Власова И.С. 29.08.24 УА #67818
&НаСервере
Функция ДобавитьНоменклатуруКЦенам(Профиль, ТаблицаЗначений)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Данные.nmId КАК nmId,
		|	Данные.Цена КАК Цена,                      
		|	Данные.Скидка КАК Скидка
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИС_WB_Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_WB_Номенклатура КАК ИС_WB_Номенклатура
		|		ПО Данные.nmId = ИС_WB_Номенклатура.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Сопоставление
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО ВТ_Номенклатура.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Номенклатура.Ссылка,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Данные.Цена, 0) КАК ЦенаДоСкидок,
		|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА НЕ Данные.Цена ЕСТЬ NULL
		|			ТОГДА Данные.Цена * ((100 - ЕСТЬNULL(Данные.Скидка, 0)) / 100)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена,
		|	ЕСТЬNULL(Данные.Скидка, 0) КАК Скидка
		|ИЗ
		|	ВТ_Сопоставление КАК ВТ_Сопоставление
		|		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		|		ПО ВТ_Сопоставление.Ссылка.Код = Данные.nmId
		|ГДЕ
		|	НЕ ВТ_Сопоставление.Номенклатура ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Данные",  ТаблицаЗначений);
	Запрос.УстановитьПараметр("Профиль", Профиль);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
		
КонецФункции //- ИнфоСофт Власова И.С. 29.08.24 УА #67818

//+ ИнфоСофт Власова И.С. 29.08.24 УА #67818
&НаСервере
Функция ОпределитьОбщийМодульРасчетаСебестоимости() Экспорт	

	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("РасчетСебестоимостиПрикладныеАлгоритмы");	
	Возврат ОбщийМодуль;	
	
КонецФункции //- ИнфоСофт Власова И.С. 29.08.24 УА #67818

#КонецОбласти 

#КонецЕсли
